# 1. Базовый образ с Python
FROM python:3.11-slim

# 2. Рабочая директория внутри кнтейнера (сюда будем копировать файлы проекта, наше приложение)
WORKDIR /app

# 3. Копируем файл зависимостей в контейнер (. - это директория /app)
COPY requirements.txt .

# 4. Устанавливаем зависимости из requirements.txt и удаляем служебные файлы
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем наш проект внутрь контейнера
COPY . .

# 6. Определяем поведение контейнера при запуске (команду) - запускаем наш проект
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]
